//version: test1.2
//题目：test1.0
var q = [
	["熔炉燃烧时，会产生多少亮度？",
		"8",
		"10",
		"13",
		"15"
	],
	["使用没有附魔的铁镐挖红石矿石，会掉落多少红石粉？",
		"2-3",
		"3-4",
		"4-5",
		"6-7"
	],
	["合成活塞时，不需要哪些物品？",
		"木棍",
		"铁",
		"红石粉",
		"木板"
	],
	["对于或门，下列描述正确的是",
		"只要有一个输入信号为真，输出即为真；所有输入都为假时，输出才会为假。",
		"只要有一个输入为真，输出即为假。当所有输入都为假时，才会输出真。",
		"只有在所有输入都为真时，才会输出真。",
		"只要输入信号有不同时，就输出真，所有输入信号都相同时，才输出假。"
	],
	["基岩版服务端“BDS”的全称是？",
		"BeDrock Server",
		"Bedrock Dedicated Server",
		"Bedrock Demo Script"
	],
	["食用马铃薯能恢复多少饥饿值？",
		"1",
		"2",
		"3",
		"4"
	],
	["食用毒马铃薯有几率获得什么效果？",
		"中毒",
		"饥饿",
		"反胃",
		"瞬间伤害"
	],
	["食用腐肉有多少概率获得中毒效果",
		"0%",
		"40%",
		"80%",
		"100"
	],
	["进度“石器时代”如何获得？",
		"在物品栏获得石头",
		"在物品栏获得石镐",
		"在物品栏获得所有石制装备",
		"在物品栏获得黑石"
	],
	["独乐不如众乐更新后，java版主界面标题被改为",
		"Minecraft",
		"Minecraft Java",
		"Minecraft Edition Java",
		"Minecraft Java Edition "
	],
	["Minecraft的官网为",
		"minecraft.net",
		"minecraft.com",
		"minecraft.cn",
		"mc.163.com"
	],
	["末影龙无法加血的情况下，被普通木剑攻击多少下会死亡？",
		"30",
		"50",
		"80",
		"100"
	],
	["以下哪个物品没有出现在创造模式物品栏",
		"基岩",
		"屏障",
		"龙蛋",
		"末地传送门框架"
	],
	["玩家如何靠近狐狸时，狐狸不会逃离",
		"潜行",
		"手持空气",
		"头戴僵尸头颅",
		"手持小麦"
	],
	["红石粉只能被放在除树叶、漏斗外上表面碰撞箱（）的方块上。",
		"8/1完整",
		"4/1完整",
		"2/1完整",
		"完全完整"
	],
	["女巫会在死亡时掉落()个红石粉",
		"0-1",
		"0-3",
		"0-6",
		"0-10"
	],
	["在基岩版中，玩家不能在哪个的世界中获得成就",
		"超平坦",
		"无限",
		"旧的",
		"超平坦以及旧的"
	],
	["基岩版首次加入狐狸是哪个版本",
		"1.13",
		"1.14",
		"1.15",
		"1.16"
	],
	["狐狸通常生成在针叶林、巨型针叶林和（）生物群系。",
		"积雪的冻原",
		"针叶林",
		"积雪的针叶林",
		"热带雨林"
	],
	["MCBE指",
		"MC BEdrock",
		"MC Bedrock Edition",
		"MINECRAFT BEdrock",
		"MINECRAFT Bedrock Edition"
	]
]